Revit 2024 API
BuiltInFailures.StairRampFailures.InvalidStairsPathFailure Property
 Invalid stairs path provided.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidStairsPathFailure { get; }
Visual Basic
Public Shared ReadOnly Property InvalidStairsPathFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidStairsPathFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace